var mysql = require('mysql');

var con = mysql.createConnection({
    host: "127.0.0.1",
    user: "root",
    password: "19960807",
    database: "finalproject",
});

con.connect(function(err) {
    if (err) throw err;
    console.log("Connected!");
    var sql = "INSERT INTO travelBuddies (themeName, owner_id, themePhoto, dateBegin, dateEnd, daysCategory_id, lastApprovedDate, personsNeeded, genderNeeded, estimatedCost, themeIntro, valid, liked ,mark) VALUES ?";
    var values = [
      ['台北熱門景點一日遊', 1, 'tb_001.jpg', '2020-10-01', '2020-10-01', 1, '2020-09-25', 3, '男女皆可', 1000, '用一天的時間，玩遍台北最熱鬧的地方！',  1, 110,35],
      ['北海岸、基隆二日遊', 2, 'tb_002.jpg', '2020-10-06', '2020-10-07', 2, '2020-10-01', 4, '男女皆可', 3500, '北海岸和東北角一直都是假期休閒玩樂的好去處，也一併去基隆廟口挖掘美食！',  1,88,30],
      ['桃竹苗一路玩四天！', 3, 'tb_003.jpg', '2020-10-11', '2020-10-14', 3, '2020-10-7', 3, '男女皆可', 5000, '桃竹苗是臺灣西北部桃園市、新竹市、新竹縣、苗栗縣四縣市的合稱，這兒有有很多農場、踏青好去處，一次來玩遍吧',  1,97,40],
      ['台南高雄6日漫活行~吃美食為主', 4, 'tb_004.jpg', '2020-11-01', '2020-11-06', 4, '2020-10-25', 1, '男性', 7000, '台南高雄吃美食，可再詳加討論要吃什麼唷~',  1,133,47],
      ['花東、綠島、蘭嶼8天旅行一次玩！', 5, 'tb_005.jpg', '2020-11-06', '2020-11-13', 5, '2020-10-31', 3, '女性', 10000, '一次玩遍花蓮、台東和綠島、蘭嶼！綠島和蘭嶼超美超讚~',  1,69,25],
      ['屏東海生館一日遊', 1, 'tb_006.jpg', '2020-12-01', '2020-12-01', 1, '2020-11-23', 1, '男女皆可', 2500, '想念屏東海生館了，來個一日遊吧，結束後可到屏東市區晃晃吃東西',  1,66,37],
      ['高雄踏踏青玩個兩天', 11, 'tb_007.jpg', '2020-12-11', '2020-12-12', 2, '2020-12-05', 2, '男女皆可', 3000, '搭捷運玩高雄唷~用輕鬆簡便的方式把高雄玩遍！',  1,44,20],
      ['金門兩天快閃！', 21, 'tb_008.jpg', '2020-12-16', '2020-12-17', 1, '2020-12-11', 2, '男女皆可', 8000, '有個小假期，想要快閃金門兩天，搭乘飛機，行程輕鬆隨意',  1,86,52],
      ['台北一日巡禮', 1, 'tb_009.jpg', '2021-01-06', '22021-01-06', 1, '2021-01-02', 2, '男女皆可', 1000, '用一天的時間，玩遍台北的故宮博物院、中正紀念堂、永康商圈、101等景點！',  1,108,85],
      ['基隆一日輕鬆玩', 31, 'tb_010.jpg', '2021-01-07', '2021-01-07', 1, '2021-01-02', 2, '男女皆可', 1000, '基隆也可以好好玩，廟口小吃一百分，海邊吹風超舒服', 1,124,46],
      ['台中一日輕旅行', 32, 'tb_011.jpg', '2021-01-11', '2021-01-11', 1, '2021-01-05', 1, '男女皆可', 800, '一台摩托車，一天玩台中~想吃宮原眼科，其他行程可詳加討論', 1,98,32],
      ['屏東台東三日遊', 41, 'tb_012.jpg', '2021-01-16', '2021-01-18', 2, '2021-01-11', 3, '男女皆可', 4000, '屏東+台東玩三天！行程含墾丁！',  1,75,44],
      ['宜蘭花蓮四日玩翻天', 51, 'tb_013.jpg', '2021-01-26', '2021-01-29', 3, '2021-01-20', 2, '男女皆可', 5500, '有雪隧的加持，玩宜蘭花蓮輕輕鬆鬆！我開車，優良旅伴跟上即可',  1,78,54],
      ['金門馬祖六天尋幽訪古', 1, 'tb_014.jpg', '2021-01-26', '2021-01-31', 4, '2021-01-20', 3, '男女皆可', 15000, '超愛金門馬祖，跟著小達人一起玩吧~',  1,99,70],
      ['北台灣深度之旅，八日！', 26, 'tb_015.jpg', '2021-02-01', '2021-02-08', 5, '2021-01-26', 3, '男女皆可', 15000, '踏實玩遍北台灣，看這篇就對了，帶你走訪野柳、淡水、北投、九份老街、陽明山等北台灣知名景點。',  1,147,56],
      ['台灣西部好好玩！南投彰化雲林嘉義秘境行五日', 1, 'tb_016.jpg', '2021-02-11', '2021-02-15', 3, '2020-02-05', 3, '男女皆可', 8000, '探索南投彰化雲林嘉義的秘密景點吧！這次專挑一些不是那麼熱門的景點，感興趣的你，一起加入吧！', 1,160,92],
      ['台東本地人的一日小旅行', 36, 'tb_017.jpg', '2021-02-17', '2021-02-17', 1, '2021-02-15', 1, '男女皆可', 1000, '台東本地人啦，想要來個一日漫遊，歡迎本地人外地人一同加入',  1,78,33],
      ['一天吃爆嘉義火雞肉飯', 46, 'tb_018.jpg', '2021-02-26', '2021-02-26', 1, '2021-02-23', 3, '男女皆可', 800, '如題名，一天吃遍嘉義火雞肉飯。也會玩一些景點啦~',  1,97,46],
      ['高雄、小琉球玩個三天', 1, 'tb_019.jpg', '2021-03-01', '2021-03-03', 1, '2021-02-25', 3, '男女皆可', 5500, '高雄一天，小琉球兩天',  1,91,81],
      ['新竹內灣老街一日遊', 56, 'tb_0020.jpg', '2021-03-06', '2021-03-06', 1, '2021-03-01', 1, '男女皆可', 700, '專攻內灣老街，也玩玩新竹其他地方，聽說巨城很好逛',  1,89,24]
    ];
    con.query(sql, [values], function (err, result) {
      if (err) throw err;
      console.log("Number of records inserted: " + result.affectedRows);
    });
  });