var mysql = require('mysql');

var con = mysql.createConnection({
    host: "127.0.0.1",
    user: "root",
    password: "19960807",
    database: "finalproject",
});

con.connect(function(err) {
    if (err) throw err;
    console.log("Connected!");
    var sql = "INSERT INTO travelBuddies (themeName, owner_id, themePhoto, dateBegin, dateEnd, daysCategory_id, lastApprovedDate, personsNeeded, genderNeeded, estimatedCost, themeIntro, valid, liked ,mark) VALUES ?";
    var values = [
      ['台北熱門景點一日遊', 1, 'tb_001.jpg', '2020-10-01', '2020-10-01', 1, '2020-09-25', 3, '男女皆可', 1000, '用一天的時間，玩遍台北最熱鬧的地方！先去西門町，再去東區，再到信義區玩樂~根據交通部觀光局，西門町的地名來自日治時代，當時的居民大多居住於臺北城內，而西門區域就是他們的休憩場所，1896年，這裡有了第一家戲院「東京亭」，1922年時，正式以「西門町」為名。西門町早期以電影院為最主要的商業活動，當時的電影院大多環繞於峨嵋街、成都路與西寧南路上，故也是西門町發展的中心，民國38年（西元1949年）國民政府遷台後，大量資金湧入此處，除了電影院外，百貨業及其他娛樂場所相繼出現，中華商場完工之後，西門町儼然已成全國最大的商業娛樂中心。',  1, 110,35],
      ['北海岸、基隆二日遊', 2, 'tb_002.jpg', '2020-10-06', '2020-10-07', 2, '2020-10-01', 4, '男女皆可', 3500, '北海岸和東北角一直都是假期休閒玩樂的好去處，也一併去基隆廟口挖掘美食！',  1,88,30],
      ['桃竹苗一路玩四天！', 3, 'tb_003.jpg', '2020-10-11', '2020-10-14', 3, '2020-10-7', 3, '男女皆可', 5000, '桃竹苗是臺灣西北部桃園市、新竹市、新竹縣、苗栗縣四縣市的合稱，這兒有有很多農場、踏青好去處，一次來玩遍吧',  1,97,40],
      ['台南高雄6日漫活行~吃美食為主', 2, 'tb_004.jpg', '2020-10-31', '2020-11-05', 4, '2020-10-25', 1, '男性', 7000, '台南高雄吃美食，可再詳加討論要吃什麼唷~',  1,133,47],
      ['花東、綠島、蘭嶼8天旅行一次玩！', 4, 'tb_005.jpg', '2020-11-06', '2020-11-13', 5, '2020-10-31', 3, '女性', 10000, '一次玩遍花蓮、台東和綠島、蘭嶼！綠島和蘭嶼超美超讚~',  1,69,25],
      ['屏東海生館一日遊', 1, 'tb_006.jpg', '2020-12-01', '2020-12-01', 1, '2020-11-23', 1, '男女皆可', 2500, '想念屏東海生館了，來個一日遊吧，結束後可到屏東市區晃晃吃東西',  1,66,37],
      ['高雄踏踏青玩個兩天', 1, 'tb_007.jpg', '2020-12-11', '2020-12-12', 2, '2020-12-05', 2, '男女皆可', 3000, '搭捷運玩高雄唷~用輕鬆簡便的方式把高雄玩遍！',  1,44,20],
      ['金門兩天快閃！', 1, 'tb_008.jpg', '2020-12-16', '2020-12-17', 2, '2020-12-11', 2, '男女皆可', 8000, '有個小假期，想要快閃金門兩天，搭乘飛機，行程輕鬆隨意',  1,86,52],
      ['台北一日巡禮', 1, 'tb_009.jpg', '2021-01-06', '22021-01-06', 1, '2021-01-02', 5, '男女皆可', 1000, '用一天的時間，玩遍台北的故宮博物院、中正紀念堂、永康商圈、101等景點！',  1,108,85],
      ['基隆一日輕鬆玩', 5, 'tb_010.jpg', '2021-01-07', '2021-01-07', 1, '2021-01-02', 2, '男女皆可', 1000, '基隆也可以好好玩，廟口小吃一百分，海邊吹風超舒服', 1,124,46],
      ['台中五日旅行', 1, 'tb_011.jpg', '2021-01-26', '2021-01-30', 3, '2021-01-05', 2, '男女皆可', 800, '一台摩托車，玩台中~想吃宮原眼科、去高美濕地，其他行程可詳加討論。高美濕地（高美野生動物保護區）的前身為高美海水浴場，從日治時期開始，海水浴場一直是遊客夏日的休閒勝地，隨著臺中港的啟用，高美海水浴場泥沙日漸淤積，導致遊客漸漸稀少，在不得已的情況下，只好宣告關閉，卻也因為泥沙的堆積，造就了今天生態豐富的高美濕地。', 1,98,32],
      ['屏東台東三日遊', 1, 'tb_012.jpg', '2021-02-01', '2021-02-03', 2, '2021-01-31', 3, '男女皆可', 4000, '屏東+台東玩三天！行程含墾丁！一起來玩吧~墾丁國家公園很大，包含永靖社區、港口社區等等。永靖社區位於屏東縣滿州鄉境內，為滿州鄉最南邊的村落，緊鄰恆春鎮，為滿州鄉第二大村落。社區內自然與人文資源豐厚，有七孔瀑布、海角七號茂伯的家、夫妻樹、草原景觀和農村生活景觀等，因與大尖山、門馬羅山遙相對望，又位於恆春半島的交通樞紐，所以永靖可說是滿州鄉的門面。特別的是，永靖社區融合了恆春民謠和多元族群音樂曲調而孕育出特有的滿州民謠文化，讓永靖擁有難得且豐富的無形文化資產。',  1,75,44],
      ['宜蘭花蓮四日玩翻天', 2, 'tb_013.jpg', '2021-02-06', '2021-02-09', 3, '2021-02-03', 2, '男女皆可', 5500, '有雪隧的加持，玩宜蘭花蓮輕輕鬆鬆！我開車，優良旅伴跟上即可。樂活宜蘭．幸福城市位處臺灣東北角的宜蘭縣，囿於三面背山、一面向海特殊地形，孕育獨特文化與人情味，呈現以三生共構的世外桃源，如今藉由亞洲第二長的公路隧道－「雪山隧道」，拉近與臺北不到50分鐘的時間，竭誠歡迎閣下打開心胸，細心品嚐自然環境的生態旅遊、養生的冷溫泉、豐沛的海洋遊憩資源，油綠的田園、悠閒漫活的生活，這就是水、綠、淨的宜蘭。',  1,78,54],
      ['金門馬祖六天尋幽訪古', 1, 'tb_014.jpg', '2021-02-11', '2021-02-16', 4, '2021-02-05', 3, '男女皆可', 15000, '超愛金門馬祖，跟著小達人一起玩吧~',  1,99,70],
      ['北台灣深度之旅，八日！', 2, 'tb_015.jpg', '2021-02-17', '2021-02-24', 5, '2021-02-05', 3, '男女皆可', 15000, '踏實玩遍北台灣，看這篇就對了，帶你走訪野柳、淡水、北投、九份老街、陽明山等北台灣知名景點。',  1,147,56],
      ['台灣西部好玩！南投彰化雲林嘉義秘境五日', 1, 'tb_016.jpg', '2021-02-26', '2021-03-02', 3, '2020-02-05', 3, '男女皆可', 8000, '探索南投彰化雲林嘉義的秘密景點吧！這次專挑一些不是那麼熱門的景點，感興趣的你，一起加入吧！', 1,160,92],
      ['台東本地人的一日小旅行', 6, 'tb_017.jpg', '2021-03-05', '2021-03-05', 1, '2021-02-05', 1, '男女皆可', 1000, '台東本地人啦，想要來個一日漫遊，歡迎本地人外地人一同加入',  1,78,33],
      ['一天吃爆嘉義火雞肉飯', 7, 'tb_018.jpg', '2021-03-06', '2021-03-06', 1, '2021-02-15', 3, '男女皆可', 800, '如題名，一天吃遍嘉義火雞肉飯。也會玩一些景點啦~',  1,97,46],
      ['高雄、小琉球玩個三天', 1, 'tb_019.jpg', '2021-03-11', '2021-03-13', 2, '2021-02-25', 3, '男女皆可', 5500, '高雄一天，小琉球兩天',  1,91,81],
      ['新竹內灣老街一日遊', 8, 'tb_020.jpg', '2021-03-14', '2021-03-14', 1, '2021-02-25', 1, '男女皆可', 700, '專攻內灣老街，也玩玩新竹其他地方，聽說巨城很好逛',  1,89,24],
      ['春日澎湖三日遊', 2, 'tb_021.jpg', '2021-03-16', '2021-03-18', 2, '2020-03-05', 3, '男女皆可', 8000, '春天玩澎湖也很不錯喔', 1,78,93],
      ['中央大學一日野餐', 9, 'tb_022.jpg', '2021-03-19', '2021-03-19', 1, '2020-03-10', 1, '男女皆可', 1000, '中央大學校園野餐',  1,45,56],
      ['日月潭二日遊', 10, 'tb_023.jpg', '2021-03-21', '2021-03-22', 2, '2021-03-10', 3, '男女皆可', 800, '日月潭兩天',  1,76,56],
      ['阿里山二日遊', 1, 'tb_024.jpg', '2021-03-26', '2021-03-27', 2, '2021-03-15', 3, '男女皆可', 5500, '阿里山兩天',  1,95,84],
      ['來去台灣最北端和最南端', 10, 'tb_025.jpg', '2021-03-28', '2021-03-30', 2, '2021-03-15', 1, '男女皆可', 700, '如題，台灣最北和最南',  1,80,21]
    ];
    con.query(sql, [values], function (err, result) {
      if (err) throw err;
      console.log("Number of records inserted: " + result.affectedRows);
    });
  });